{"format": "graph-model", "generatedBy": "2.0.0", "convertedBy": "TensorFlow.js Converter v1.2.3", "modelTopology": {"node": [{"name": "accuracy_calculation/prediction/dimension", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "output_out_layer3/Weight", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "out_layer2/Weight", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "out_layer_drop/truediv", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "out_layer_drop/rate", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "out_layer1/Weight", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "784"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "X", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "784"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "out_layer1/Bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "out_layer2/Bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "output_out_layer3/Bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "out_layer1/MatMul", "op": "MatMul", "input": ["X", "out_layer1/Weight"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "out_layer1/add", "op": "AddV2", "input": ["out_layer1/Bias", "out_layer1/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "out_layer1/Relu", "op": "Relu", "input": ["out_layer1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "out_layer_drop/Shape", "op": "Shape", "input": ["out_layer1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "out_layer_drop/random_uniform/RandomUniform", "op": "RandomUniform", "input": ["out_layer_drop/Shape"], "attr": {"seed": {"i": "0"}, "T": {"type": "DT_INT32"}, "dtype": {"type": "DT_FLOAT"}, "seed2": {"i": "0"}}}, {"name": "out_layer_drop/GreaterEqual", "op": "GreaterEqual", "input": ["out_layer_drop/random_uniform/RandomUniform", "out_layer_drop/rate"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "out_layer_drop/Cast", "op": "Cast", "input": ["out_layer_drop/GreaterEqual"], "attr": {"SrcT": {"type": "DT_BOOL"}, "Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}}}, {"name": "out_layer_drop/mul", "op": "Mul", "input": ["out_layer_drop/Cast", "out_layer_drop/truediv"], "attr": {"_grappler:ArithmeticOptimizer:MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "out_layer_drop/mul_1", "op": "Mul", "input": ["out_layer1/Relu", "out_layer_drop/mul"], "attr": {"_grappler:ArithmeticOptimizer:MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "out_layer2/MatMul", "op": "MatMul", "input": ["out_layer_drop/mul_1", "out_layer2/Weight"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "out_layer2/add", "op": "AddV2", "input": ["out_layer2/Bias", "out_layer2/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "out_layer2/Relu", "op": "Relu", "input": ["out_layer2/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "output_out_layer3/MatMul", "op": "MatMul", "input": ["out_layer2/Relu", "output_out_layer3/Weight"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "output_out_layer3/add", "op": "AddV2", "input": ["output_out_layer3/Bias", "output_out_layer3/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "output_out_layer3/Relu", "op": "Relu", "input": ["output_out_layer3/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "accuracy_calculation/prediction", "op": "ArgMax", "input": ["output_out_layer3/Relu", "accuracy_calculation/prediction/dimension"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "output_type": {"type": "DT_INT64"}}}], "library": {}, "versions": {"producer": 38}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "accuracy_calculation/prediction/dimension", "shape": [], "dtype": "int32"}, {"name": "output_out_layer3/Weight", "shape": [64, 10], "dtype": "float32"}, {"name": "out_layer2/Weight", "shape": [512, 64], "dtype": "float32"}, {"name": "out_layer_drop/truediv", "shape": [], "dtype": "float32"}, {"name": "out_layer_drop/rate", "shape": [], "dtype": "float32"}, {"name": "out_layer1/Weight", "shape": [784, 512], "dtype": "float32"}, {"name": "out_layer1/Bias", "shape": [512], "dtype": "float32"}, {"name": "out_layer2/Bias", "shape": [64], "dtype": "float32"}, {"name": "output_out_layer3/Bias", "shape": [10], "dtype": "float32"}]}]}